# -*- coding: utf-8 -*-
import screen

info = {
                "CLH17":{
                    "종목명":"CRUDEOIL",
                    "시간단위":120,
                    "단위":0.01,
                    "자릿수": 2,
                    "화면번호":screen.S9999,
                    "상태":"중립대기",
                    "매매구간누적캔들": 0,
                    "최소연속틱":40,
                    "이동평균선":[30, 120],
                    "마감시간": '0700',
                    "시작시간": '0800',
                    "주문내용": {}
                    }
                #"GC":{
                #    "종목명":"GOLD",
                #    "종목코드":"GCG17",
                #    "시간단위":120,
                #    } 
            }

'''
중립대기 
매매선터치 
매매구간진입 
매매시도중
매매중
청산시도중
매매중
매매완료 or 중립대기
'''